Revit 2027 API
EnergyAnalysisDetailModelOptions.Tier Property
 Level of computation for energy analysis model.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public EnergyAnalysisDetailModelTier Tier { get; set; }
Public Property Tier As EnergyAnalysisDetailModelTier
	Get
	Set
public:
property EnergyAnalysisDetailModelTier Tier {
	EnergyAnalysisDetailModelTier get ();
	void set (EnergyAnalysisDetailModelTier value);
}
member Tier : EnergyAnalysisDetailModelTier with get, set
Property Value
EnergyAnalysisDetailModelTier
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Remarks
 The default value is EnergyAnalysisModelTier::Final.
See Also
Reference
EnergyAnalysisDetailModelOptions Class
Autodesk.Revit.DB.Analysis Namespace